# Homebrew packages for laptop provisioning
# Run: brew bundle

# Skip macOS Gatekeeper quarantine prompts for casks
cask_args quarantine: false

# Version management
brew "asdf"
brew "ruby-build"

# Shell
brew "zsh"

# Editors
# brew "neovim"
brew "vim"

# Git & GitHub
brew "git"
brew "gh"

# Search & navigation
brew "fd"
brew "fzf"
brew "ripgrep"
brew "the_silver_searcher"
brew "tree"
brew "yazi"

# Languages & runtimes
brew "go"
brew "rust"

# Language servers & linters
brew "lua-language-server"
brew "pgformatter"
brew "shellcheck"
brew "stylua"

# Database
brew "postgresql"

# Cloud & infrastructure
brew "awscli"
brew "helm"
brew "kubectx"
brew "kubernetes-cli"

# JSON & YAML
brew "jq"
brew "yq"

# Dependencies
brew "gmp"
brew "libyaml"
brew "openssl@3"
brew "readline"

# CLI tools
brew "bat"
brew "snyk-cli"
brew "tldr"
brew "uv"
brew "watch"
brew "yarn"
brew "zellij"

# Game development
brew "freeimage"
brew "sdl2"

# Casks
cask "1password-cli"
cask "docker-desktop"
cask "ghostty"
cask "ngrok"
cask "pgadmin4"
cask "visual-studio-code"
cask "warp"
